docs/2022-07-18-bootstrapping-my-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-19 Tue 11:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Notes</title>
<meta name="author" content="Thomas" />
<meta name="description" content="Story of how I ended up with my notes in org-mode." />
<meta name="keywords" content="org-mode, emacs, vim, notes" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="./"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">My Notes
<br />
<span class="subtitle">Bootstrapping My Notes</span>
</h1>
<p>
It all started when I discovered <a href="https://orgmode.org/">org-mode</a> a few years back. Before that I was a
happy vim user, using vim form all sort of complex text processing. I even used
a vim plugin in my Java IDE. But I never used vim, or text files for that
matter, to take notes or manage my to-do list. Then one fine day, I watched with
awe as one of my friends used org-mode to manage pretty much every aspect about
his life, from accounting to grocery shopping. And just like that I decided to
abandon my then decade old allegiance to vim and join the Emacs club.
</p>

<p>
While trying to switch to Emacs, I realized that it takes a lot of effort to
unlearn the VI key bindings, and started using the <a href="https://github.com/emacs-evil/evil">Evil mode</a>. After trying the
out-of-the-box emacs experience and a few other flavours, and fast forwarding a
couple of years, I finally settled on the <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a>. And by now I&rsquo;m using
org-mode for managing all sort of things. Unlike the vim days, now there are
many rarely used, but really nice features, that I keep looking up, using once
and then forgetting how to use again. So instead of keep searching them every
time, and experiencing the &ldquo;Déjà vu&rdquo; while clicking on the same three poorly
written articles, before finally finding the right one, I decided to write my
own notes.
</p>

<p>
Then one day, it occurred to me that despite having my own notes, I still search
for the same things in the internet. This is mainly because I don&rsquo;t remember if
I have something in my notes or not. So I decided that, in future, any notes
that I write should be good enough to publish, so that I can actually publish
them and let the search engine lead me back to my own notes. Then comes the
question of how to publish them. Popular blogging platforms are very easy to
start with, and gives me good reach that I could never get on my own. But my
target radiance is primarily just future me. And even if I spent some time for
the initial set-up, adding new notes to the collection should be frictionless.
Meaning, it should not take me away from whatever that I&rsquo;m doing. Creating a new
post in any popular blogging platform is a mouse heavy operation that forces me
to switch context. Creating github pages on the other hand is something I can do
from any text editor, and publishing is just a push away.
</p>

<p>
The decisions are made, project structure created, and now writing this
article/note/blog/whatever as a test post for the new system. Let&rsquo;s see how many
actual notes do I end up publishing.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-07-18 Mon 20:00</p>
<p class="author">Author: Thomas</p>
<p class="date">Created: 2022-07-19 Tue 11:00</p>
</div>
</body>
</html>
